h=1/50;
k=1/50;
I=1/h;
J=1/k;
%构造矩阵每行（I-1）*J个元素，共（I-1）*J个列

%一下是有五个非零元素的矩阵元素
for i=2:1:I-2
    for j=2:1:J-1
        A((I-1)*(j-1)+i,(I-1)*(j-1)+i)=-2/(h*h)-2/(k*k);
        A((I-1)*(j-1)+i,(I-1)*(j-1)+i-1)=1/(h*h);
        A((I-1)*(j-1)+i,(I-1)*(j-1)+i+1)=1/(h*h);
        A((I-1)*(j-1)+i,(I-1)*(j-2)+i)=1/(k*k);
        A((I-1)*(j-1)+i,(I-1)*j+i)=1/(k*k);
    end
end
%左下角点A（1,1），三个非零元素
i=1;
j=1;
A(i,j)=-2/(h*h)-2/(k*k);
A(i,j+1)=1/(h*h);
A(i,j+I-1)=1/(k*k);
%右下角点A(I-1,1)，三个非零元素
i=I-1;
j=1;
A(i,i)=-2/(h*h)-2/(k*k);
A(i,i+1)=1/(h*h);
A(i,i+I-1)=1/(k*k);
%最下面一排，四个非零元素
j=1;
for i=2:1:I-2
    A(i,i)=-2/(h*h)-2/(k*k);
    A(i,i+1)=1/(h*h);
    A(i,i-1)=1/(h*h);
    A(i,i+I-1)=1/(k*k);
end
%左侧的一排，有四个非零元素的
i=1;
for j=2:1:J-1
    A(i+(I-1)*(j-1),i+(I-1)*(j-1))=-2/(h*h)-2/(k*k);
    A(i+(I-1)*(j-1),i+(I-1)*j)=1/(k*k);
    A(i+(I-1)*(j-1),i+(I-1)*(j-2))=1/(k*k);
    A(i+(I-1)*(j-1),i+(I-1)*(j-1)+1)=1/(h*h);
end
%右侧一排，有四个非零元素的
i=I-1;
for j=2:1:J-1
    A(i+(I-1)*(j-1),i+(I-1)*(j-1))=-2/(h*h)-2/(k*k);
    A(i+(I-1)*(j-1),i+(I-1)*j)=1/(k*k);
    A(i+(I-1)*(j-1),i+(I-1)*(j-2))=1/(k*k);
    A(i+(I-1)*(j-1),i+(I-1)*(j-1)-1)=1/(h*h);
end
%最上面一排
j=J;
for i=1:1:I-1
    A(i+(I-1)*(j-1),i+(I-1)*(j-1))=(1+1/h);
    A(i+(I-1)*(j-1),i+(I-1)*(j-2))=-1/h;
end
%求向量b
for i=1:1:(I-1)*(J-1)
    b(i)=-16;
end
for i=(I-1)*(J-1)+1:1:(I-1)*J
    b(i)=0;
end
%解矩阵的值
x=gmres(A,b');
%将解向量还原成矩阵
for i=1:1:J
    for j=1:1:I-1
    B(i+1,j+1)=x(j+(I-1)*(i-1));
    end
end
B(1,:)=0;
B(:,1)=0;
B(:,I+1)=0;
i=0:1:I;
j=0:1:J;
%画图
surf(i*h,j*k,B);